[
    {
        "heading": "Introduction",
        "text": "\tGame of Ur is a race game played between two players.\n\n\tThe players are given 5 pieces each which they attempt to move to the end of the route on the game board.  The one to do so first, wins the game.\n\n\tBoth players are also each given 25 counters to represent their wagers.  These counters may be won from or lost to their opponent over the course of play.",
        "image_filepath": "data/textures/tutorial/ui_unmarked.png"
    },

    {
        "heading": "Game UI",
        "text": "\t1.  The game phase display.  Displays whose turn it is, current game phase, and action required.\n\n\t2.  The dice display.  Has a button to roll dice, displays dice state and last turn's roll.\n\n\t3.  The common counters.  No. of counters the winning player can earn.\n\n\t4.  Player panels.  Per player: no. of counters held, and the state of their pieces.  Launchable pieces can be clicked and added to the board.",
        "image_filepath": "data/textures/tutorial/ui_w_labels_1.png"
    },

    {
        "heading": "Game UI Cont'd",
        "text": "\t5.  End turn.  Ends current turn, or begins next phase of play.\n\n\t6.  The board.  Divided into\n\t- a.  The battlefield, where pieces belonging to either player may be placed.\n\t- b.  Black's region.\n\t- c.  White's region.\n\t- d.  Rosette houses.  Special tiles which allow player to win or lose counters, whose occupant gains knock-out immunity.\n\n\t7.  A game piece.  Clicking on it after a valid roll causes it to move forward.",
        "image_filepath": "data/textures/tutorial/ui_w_labels_2.png"
    },

    {
        "heading": "Dice",
        "text":"\tThe game includes a pair of dice.\n\n\tThese dice are used to determine which player takes the first turn, to launch pieces to the board, and to move pieces on the board along the designated route.\n\n\tThe first 4 sided (primary) die produces a score between 1-4.\n\n\tThe second 2 sided (double-or-quits) die, if used, can \"double\" or otherwise completely negate the primary score.",
        "image_filepath": "data/textures/tutorial/dice_panel.png"
    },

    {
        "heading": "Dice Cont'd",
        "text": "\tThe following table shows how the primary score is modified after successfully rolling double with the 2 sided die:",
        "image_filepath": "data/textures/tutorial/dice_doubling.png"
    },

    {
        "heading": "Initiative",
        "text": "\tDuring the first phase of play, the initiative phase, each player rolls both dice, and takes note of the resulting score.\n\n\tThe player with the higher score receives the black piece set, and starts the game.  The other player receives white.\n\n\t(Note: when the double-or-quits die is rolled during this phase, rolling quits does not nullify the player's primary score.)",
        "image_filepath": "data/textures/tutorial/initiative_screen.png"
    },

    {
        "heading": "The Route",
        "text": "\tThis diagram shows the route the players playing white and black respectively must take to win the game.\n\n\tMarked also are the houses corresponding to the launch locations of all pieces except the Swallow.",
        "image_filepath": "data/textures/tutorial/board_route.png"
    },

    {
        "heading": "One Turn",
        "text": "Each turn, the player:\n\n\t1.  Rolls primary die.\n\t- a.  If a larger score is desired, the player may roll the secondary, risking skipping their turn on failure.\n\n\t2.  Selects a piece to launch or move.\n\t- a.  Pieces that can be launched are highlighted in the player panel.\n\t- b.  Any piece on the board belonging to them can be moved per the roll, provided the resulting tile is valid.\n\n\t3.  Ends their turn once a move is made, or if no valid move exists.",
        "image_filepath": "data/textures/tutorial/ui_one_turn.png"
    },

    {
        "heading": "Movement",
        "text": "\tAny piece may be moved into any unoccupied house.\n\n\tAn opponent's piece on a non-rosette house can be knocked out and replaced.\n\n\tTo move a piece off the board, a roll of 1 + <no. of houses to the last house from that piece> is required.\n\n\tPassing a rosette loses counters, landing wins counters.  No. of counters traded depends on the moved piece.\n\n\tA piece cannot replace other pieces belonging to the same player.",
        "image_filepath": "data/textures/tutorial/ui_unmarked.png"
    },

    {
        "heading": "Launch",
        "text": "The following table shows the roll required to launch each piece, along with its valid starting house(s):",
        "image_filepath": "data/textures/tutorial/launch_table.png"
    },

    {
        "heading": "Launching the Swallow",
        "text": "The Swallow piece has a special launch method.  When it is available to be launched, click on the Swallow launch button (Sw), then click on a board location one house behind a rosette house.\n\n\tRight clicking, or clicking on an invalid location, cancels launch location selection.",
        "image_filepath": "data/textures/tutorial/ui_launch_swallow.png"
    },

    {
        "heading": "Game Piece Values",
        "text": "This table shows the no. of counters won or lost by landing or failing to land on a rosette square, corresponding to each piece:",
        "image_filepath": "data/textures/tutorial/value_table.png"
    }
]
